In [13]:
%pylab inline
import pandas as pd
import seaborn as sb

Populating the interactive namespace from numpy and matplotlib

In [4]:
data = pd.read_csv('uber-raw-data-apr14.csv')

In [5]:
data

                 Date/Time      Lat      Lon    Base
0         4/1/2014 0:11:00  40.7690 -73.9549  B02512
1         4/1/2014 0:17:00  40.7267 -74.0345  B02512
2         4/1/2014 0:21:00  40.7316 -73.9873  B02512
3         4/1/2014 0:28:00  40.7588 -73.9776  B02512
4         4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                    ...      ...      ...     ...
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

[564516 rows x 4 columns]

In [6]:
data['Date/Time']

0           4/1/2014 0:11:00
1           4/1/2014 0:17:00
2           4/1/2014 0:21:00
3           4/1/2014 0:28:00
4           4/1/2014 0:33:00
                 ...
564511    4/30/2014 23:22:00
564512    4/30/2014 23:26:00
564513    4/30/2014 23:31:00
564514    4/30/2014 23:32:00
564515    4/30/2014 23:48:00
Name: Date/Time, Length: 564516, dtype: object

In [7]:
data.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [8]:
data.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

In [11]:
dt = 4/30/2014

In [9]:
dt = '4/30/2014 23:22:00'

In [14]:
d, t = dt.split(' ')
print(d)
print(t)

AttributeError: 'float' object has no attribute 'split'

In [15]:
m,d,y = d.split('/')

NameError: name 'd' is not defined

In [12]:
m
d
y

'2014'

In [13]:
m

'4'

In [14]:
d

'30'

In [15]:
d1=int(d)

In [16]:
d1

30

In [17]:
dt

'4/30/2014 23:22:00'

In [18]:
dt.month

AttributeError: 'str' object has no attribute 'month'

In [20]:
dt = pd.to_datetime(dt)

In [21]:
dt

Timestamp('2014-04-30 23:22:00')

In [22]:
dt.month

4

In [23]:
dt.year

2014

In [24]:
dt.week

18

In [2]:
data['Date/Time'] = data['Date/Time'].map(pd.to_datetime)

NameError: name 'data' is not defined